2024-01-04-new-year-new-blog.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="julian3ng.github.io/rss.xml"
      title="RSS feed for julian3ng.github.io">
<title>New Year New Blog</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">04 Jan 2024</div><h1 class="post-title"><a href="julian3ng.github.io/2024-01-04-new-year-new-blog.html">New Year New Blog</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org97de47b">1. Motivation</a></li>
<li><a href="#org9b61a58">2. Technology</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org97de47b" class="outline-2">
<h2 id="org97de47b"><span class="section-number-2">1.</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
For a couple of years, I've been going back and forth on making a blog. I
decided to make 2024 the year I actually publish something &#x2013; I hope to have at
least a little to write about this year. My intention for this blog is to log my
progress in some long-term projects that started their lives as new year's
resolutions, and to be able to look back later and see how far I've come.
</p>


<p>
Such projects include:
</p>
<ul class="org-ul">
<li>Game dev
<ul class="org-ul">
<li>Do some Godot tutorials</li>
</ul></li>
<li>Calisthenics
<ul class="org-ul">
<li>Handstand
<ul class="org-ul">
<li>Handstand press</li>
</ul></li>
<li>Muscle up</li>
<li>Pistol squat</li>
</ul></li>
<li>Pixel art</li>
<li>Climbing
<ul class="org-ul">
<li>Do a V7</li>
</ul></li>
<li>Korean
<ul class="org-ul">
<li>Finishing <span class="underline">Integrated Korean</span> (book 1)</li>
</ul></li>
</ul>

<p>
Also, having a blog will give me somewhere to exercise my atrophied writing chops and
tinker with web design.
</p>
</div>
</div>
<div id="outline-container-org9b61a58" class="outline-2">
<h2 id="org9b61a58"><span class="section-number-2">2.</span> Technology</h2>
<div class="outline-text-2" id="text-2">
<p>
This blog is made with:
</p>
<ul class="org-ul">
<li><a href="https://github.com/bastibe/org-static-blog">org-static-blog</a></li>
<li>Github Pages</li>
</ul>


<p>
And that's it! I didn't want to play around with anything beefier or I'd end
up trying to arrange everything <b>just so</b> and never write anything.
<code>org-static-blog</code> lets me generate the blog through some Emacs commands, and I
can just push it to Github and not think too hard.
</p>
</div>
</div>
<div class="taglist"><a href="julian3ng.github.io/tags.html">Tags</a>: <a href="julian3ng.github.io/tag-meta.html">meta</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
